<a href="https://colab.research.google.com/github/daje0601/Python-2020/blob/master/pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 3. Data 합치기 & 줄이기  

#### 우리는 큰 틀에서 df를 다루는 방법을 배운 후 data 다루기를 진행할 예정입니다. . 
#### 그래서 지난 시간 df를 생성하는 방법과 큰 틀에서 column&row를 다루는 방법에 대해 배웠습니다.

#### 오늘은 여러개의 df file을 column방향과 row 방향으로 합치는 연습을 진행할 예정입니다.

## 1) data 불러오기 복습 & df와 print(df) 차이?

In [1]:
# 자~ 데이터를 불러와볼게요 
import pandas as pd 
import numpy as np

!pandas read csv form github

#[url로 외부에서 데이터 가져오기]
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/car_crashes.csv"
df = pd.read_csv(url)

/bin/bash: pandas: command not found

In [2]:
# 항상 내가 원하는 데이터를 잘 가져왔는지 확인하는 습관이 증요합니다!
# 데이터 확인 

df.head()

# 데이터 줄이는 코드 : 데이터가 크기 때문에 줄여서 실습함 
df = df.iloc[0:5, 0:5]
df

   total  speeding  alcohol  not_distracted  no_previous
0   18.8     7.332    5.640          18.048       15.040
1   18.1     7.421    4.525          16.290       17.014
2   18.6     6.510    5.208          15.624       17.856
3   22.4     4.032    5.824          21.056       21.280
4   12.0     4.200    3.360          10.920       10.680

In [3]:
# 합쳐야하기 때문에 오늘은 기본 데이터에서 작은 단위로 df1, df2, df3을 만들겠습니다.

df1 = df.iloc[0:, 0:3]
df2 = df.iloc[0:, 2:4]
df3 = df.iloc[0:3, 0:2]

# 여러분들은 반드시 하나하나씩 출력하여 어떤 데이터가 나오는지 확인하시기 바랍니다. 
# 저는 오늘 shape라는 걸 여러분깨 보여드리기 위해서 아래와 같이 출력하여 데이터를 확인하였습니다. 


# shape란? 데이터가 몇 개의 column, 몇 개의 row를 보여주는 명령어 입니다. 

print(df1.shape, df2.shape, df3.shape)

# 또 하나의 숙제! df만 입력하는 것과 print(df)를 각각 출력해보세요 어떤 차이가 있는지도 꼭 확인해보세요!

(5, 3) (5, 2) (3, 2)

In [4]:
# 왠지 출력을 안해봤을거 같아서..!
df1

   total  speeding  alcohol
0   18.8     7.332    5.640
1   18.1     7.421    4.525
2   18.6     6.510    5.208
3   22.4     4.032    5.824
4   12.0     4.200    3.360

In [5]:
# 왠지 출력을 안해봤을거 같아서..!!!
df2

   alcohol  not_distracted
0    5.640          18.048
1    4.525          16.290
2    5.208          15.624
3    5.824          21.056
4    3.360          10.920

In [6]:
# 왠지 출력을 안해봤을거 같아서..!!!!!
df3

   total  speeding
0   18.8     7.332
1   18.1     7.421
2   18.6     6.510

In [7]:
# print도 안찾아봤을거 같아!!!!!
print(df1)
print(df2)
print(df3)
# print를 하면 여러개를 동시에 출력할 수 있는데, 단, 예쁘지 않아

   total  speeding  alcohol
0   18.8     7.332    5.640
1   18.1     7.421    4.525
2   18.6     6.510    5.208
3   22.4     4.032    5.824
4   12.0     4.200    3.360
   alcohol  not_distracted
0    5.640          18.048
1    4.525          16.290
2    5.208          15.624
3    5.824          21.056
4    3.360          10.920
   total  speeding
0   18.8     7.332
1   18.1     7.421
2   18.6     6.510

In [8]:
df1
df2
df3
# print를 사용하지 않으면 맨 마지막줄(df3)만 출력된다 
# 만약 이런게 귀찮고 안해본 사람이라면 지금이도 늦지 않았습니다. 코딩 그만두세요!
# 뒤로 가면 더 귀찮고 그러실텐데.. 시간은 정말 소중한 것입니다.

   total  speeding
0   18.8     7.332
1   18.1     7.421
2   18.6     6.510

---

## 2) concat


df를 합치기 위해서는 concat 또는 merge를 사용해야합니다. 
절대 어려운게 아닙니다. 보세요

In [9]:
# concat을 사용하여 가로방향으로 더하기 
pd.concat ([df1, df2], axis=1)

   total  speeding  alcohol  alcohol  not_distracted
0   18.8     7.332    5.640    5.640          18.048
1   18.1     7.421    4.525    4.525          16.290
2   18.6     6.510    5.208    5.208          15.624
3   22.4     4.032    5.824    5.824          21.056
4   12.0     4.200    3.360    3.360          10.920

In [10]:
# merge를 사용하여 가로방향 더하기
df1.merge(df2, how="inner", on="alcohol")

   total  speeding  alcohol  not_distracted
0   18.8     7.332    5.640          18.048
1   18.1     7.421    4.525          16.290
2   18.6     6.510    5.208          15.624
3   22.4     4.032    5.824          21.056
4   12.0     4.200    3.360          10.920

In [11]:
# concat을 사용하여 세로방향으로 더하기
pd.concat ([df1, df2], axis=0)

# concat 외 병합하는 방법에 대해서는 아래 링크를 참조하여 공부하세요 
# https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

   total  speeding  alcohol  not_distracted
0   18.8     7.332    5.640             NaN
1   18.1     7.421    4.525             NaN
2   18.6     6.510    5.208             NaN
3   22.4     4.032    5.824             NaN
4   12.0     4.200    3.360             NaN
0    NaN       NaN    5.640          18.048
1    NaN       NaN    4.525          16.290
2    NaN       NaN    5.208          15.624
3    NaN       NaN    5.824          21.056
4    NaN       NaN    3.360          10.920

## 3) merge

In [12]:
# 우리는 merge에 대해서 조금 더 살펴볼 필요가 있습니다. 
# merge를 이해기 위해 한시적으로 다른 데이터를 만들어 보겠습니다. 

ex_merge1 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A", "1", "1", "1"],
        "B": ["B", "1", "1", "1"],
    }
)


ex_merge2 = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C", "0", "0", "0"],
        "D": ["D", "0", "0", "0"],
    }
)

In [13]:
ex_merge1

  key1 key2  A  B
0   K0   K0  A  B
1   K0   K1  1  1
2   K1   K0  1  1
3   K2   K1  1  1

In [14]:
ex_merge2

  key1 key2  C  D
0   K0   K0  C  D
1   K1   K0  0  0
2   K1   K0  0  0
3   K2   K0  0  0

처음으로 조금 복잡해 보이는 코드를 적어보겠습니다. 
저도 이를 이해하는데 30분이라는 귀한 시간을 투자하였습니다.  
   
  
  merge는 
무조건 pd.merge(ex_merge1, ex_emerg2을 적으면
ex_merge1에 다가 ex_merge2를 더해준다라고 생각하시면 됩니다.  
  
  
## merge에게는 어떤 row와 어느 column을 병합시킬지 기준을 전달해주어야 합니다.  
  
## how는 row의 기준이되며, on은 column의 기준이 됩니다  


#### 바로 예제를 봐볼까요?

In [15]:
# ex_merge1에 다가 ex_merge2를 더해주는데 merge1의 row 기준과 column["key1", "key2"] 기준으로 병합하자
# 위 문장을 코드로 적으면 아래 코드가 됩니다. 

pd.merge(ex_merge1, ex_merge2, how="left", on=["key1", "key2"])

# 이렇게 merge를 시키면 ex_merge1과 ex_merge2의 on을 확인하며 실행이 되다가 
# merge1의 on 값이 종료되는 시점에 맞추어 표가 합쳐집니다.  

# merge1에는 있는데 merge2에는 없는 값들은 NaN(결측치)를 출력하게 된다 
# NaN(결측치)은 값이 없다라는 걸 나타낸다고 간단히 이해하면 된다.

  key1 key2  A  B    C    D
0   K0   K0  A  B    C    D
1   K0   K1  1  1  NaN  NaN
2   K1   K0  1  1    0    0
3   K1   K0  1  1    0    0
4   K2   K1  1  1  NaN  NaN

In [16]:
# 이번에는 how에 right를 주면 어떻게 될까요? 궁금하죠?

pd.merge(ex_merge1, ex_merge2, how="right", on=["key1", "key2"])

# right를 주니 on 값은 merge2를 기준으로 합니다.

  key1 key2    A    B  C  D
0   K0   K0    A    B  C  D
1   K1   K0    1    1  0  0
2   K1   K0    1    1  0  0
3   K2   K0  NaN  NaN  0  0

In [17]:
# how에는 outer와  inner도 있습니다. 같이 한번 살펴보도록 하죠!

pd.merge(ex_merge1, ex_merge2, how="outer", on=["key1", "key2"])

# 보시다시피 merge1과 merge2의 모든 row를 받아오고 데이터를 만드네요

  key1 key2    A    B    C    D
0   K0   K0    A    B    C    D
1   K0   K1    1    1  NaN  NaN
2   K1   K0    1    1    0    0
3   K1   K0    1    1    0    0
4   K2   K1    1    1  NaN  NaN
5   K2   K0  NaN  NaN    0    0

In [18]:
pd.merge(ex_merge1, ex_merge2, how="inner", on=["key1", "key2"])

# inner는 공통된 값들만 받아와서 데이터를 만드네요 
# 우리는 key1, key2를 기준으로만 살펴보았습니다. 만약 on값을 변경하면 어떻게 되는지 꼭 실습해보세요
# 이번에는 안보여드릴거에요 그리고 모르시겠다면 꼭 공식홈페이지에 가셔서 확인하셔야해요 
# 링크 : https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

  key1 key2  A  B  C  D
0   K0   K0  A  B  C  D
1   K1   K0  1  1  0  0
2   K1   K0  1  1  0  0

## 우리는 concat과 merge의 기초에 대해서 배웠습니다. 
## 절대 알려드린 부분이 전부 다가 아님을 명심하시고 부족한 부분은 구글링과 
## pandas공식홈페이지에서 반드시 찾아보시고 숙지하셔야 합니다. 
## merge는 나~~~~중에 SQL을 다룰때 
## 무척 중요하게 사용되는 개념이니 꼭 실습해보시고 공식홈페이지도 읽어보세요
## 오늘은 여기까지 하도록 하겠습니다.